{
  "backend/main.mo": "Motoko canister implementing access‑controlled user caffeine tracking with profiles, entries, presets, and settings stored per principal.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, components, and related requirements with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries for key frontend files describing styles, config, pages, components, and utilities.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables defining light and dark mode color tokens and global layout defaults.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, global layout, and routes for all main pages.",
  "frontend/src/components/app/AppShell.tsx": "Global layout with header, navigation tabs, footer, and user greeting based on loaded profile.",
  "frontend/src/components/app/QueryState.tsx": "Shared UI components for loading, error, and empty states.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with query cache clearing and auto‑retry handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time profile creation with name input and save handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps children with authentication checks, showing login UI or profile setup dialog when needed.",
  "frontend/src/components/caffeine/EntryFormDialog.tsx": "Dialog for creating or editing caffeine entries with preset selection and form submission logic.",
  "frontend/src/components/caffeine/PresetManager.tsx": "Manages creation and display of caffeine drink presets with a form and list of existing presets.",
  "frontend/src/components/caffeine/TrendChart7d.tsx": "Renders a 7‑day bar chart of caffeine totals with limit indicators using calculated SVG layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and handles login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user data, profiles, caffeine entries, presets, and settings via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light and dark modes, and global typography styles.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the App.",
  "frontend/src/pages/DashboardPage.tsx": "Displays today's caffeine intake, progress toward limits, and provides an entry form dialog with auto-open support.",
  "frontend/src/pages/InsightsPage.tsx": "Generates 7‑day caffeine trends, totals, and limit comparisons, rendering charts and insight cards.",
  "frontend/src/pages/LogPage.tsx": "Lists all caffeine entries grouped by date with delete actions and a shortcut to add a first entry.",
  "frontend/src/pages/SettingsPage.tsx": "Allows updating daily caffeine limits and managing presets, with validation and save actions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters for persistent routing state.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, animations, and plugins.",
  "project_state.json": "Stores the project’s state including versioning, existing features, new requests, and metadata for a UX improvement project."
}