{
  "backend/main.mo": "Motoko canister managing user profiles, caffeine entries, presets, and settings with authorization checks.",
  "feature_evidence.json": "Metadata linking features to frontend files, components, and test requirements for build traceability.",
  "frontend-file-summaries.txt": "List of short descriptions summarizing major frontend files and their roles.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global typography.",
  "frontend/index.html": "Basic HTML entry point loading the root React app.",
  "frontend/src/App.tsx": "Main app routing setup with authentication, theming, and page route definitions.",
  "frontend/src/components/app/AppShell.tsx": "Layout wrapper providing header, navigation, footer, and user greeting.",
  "frontend/src/components/app/QueryState.tsx": "Reusable loading, error, and empty-state UI components.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button integrated with React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal for entering and saving a user's name during initial profile setup.",
  "frontend/src/components/auth/RequireAuth.tsx": "Gate component that handles login flow, loads user profile, and prompts setup if missing.",
  "frontend/src/components/caffeine/EntryFormDialog.tsx": "Dialog for adding or editing a caffeine entry, supporting presets and custom input.",
  "frontend/src/components/caffeine/PresetManager.tsx": "UI for creating new caffeine drink presets and listing existing ones.",
  "frontend/src/components/caffeine/TrendChart7d.tsx": "Renders a 7‑day bar chart of caffeine totals with limit line indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity, and status states.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user data, profiles, caffeine entries, presets, and settings via an actor API.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, fonts, and light/dark color palettes for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Displays daily caffeine stats, hero section, and add-entry dialog using user data and mutation hooks.",
  "frontend/src/pages/InsightsPage.tsx": "Computes and presents 7‑day caffeine trends, totals, and averages with charts and summary cards.",
  "frontend/src/pages/LogPage.tsx": "Shows a grouped, sortable log of caffeine entries with delete functionality and empty-state handling.",
  "frontend/src/pages/SettingsPage.tsx": "Allows updating daily caffeine limit, managing presets, and viewing general caffeine guidelines.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing app goals, feature states, and image requirements for a caffeine‑tracking app."
}