{
  "kind": "build_request",
  "title": "Polish UX: better empty-state actions, dashboard progress indicator, and footer link cleanup",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the Log page empty-state primary action actually help the user add their first entry by navigating to the Dashboard and automatically opening the Add Entry dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes you can improve it"
        ]
      },
      "acceptanceCriteria": [
        "When there are zero entries, clicking the empty-state button on /log routes the user to / (Dashboard).",
        "After navigation from the Log empty state, the Add Entry dialog opens automatically without additional clicks.",
        "The auto-open behavior triggers only once and does not keep re-opening on subsequent renders/navigation.",
        "No changes are made to immutable hook files (e.g., frontend/src/hooks/useInternetIdentity.ts[x], frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the Dashboard’s readability by adding a clear visual indicator of daily limit usage (e.g., a progress bar or meter) and ensuring the over-limit state is visually distinct and accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes you can improve it"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard shows a visual percent-used indicator for today’s caffeine intake relative to the daily limit.",
        "The indicator has a clear over-limit style (e.g., destructive color treatment) when todayTotal > dailyLimit.",
        "User-facing text remains in English and existing metrics (today total, daily limit, remaining) remain correct."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Clean up footer social icons so they are not dead links: replace placeholder href=\"#\" links with a non-clickable/disabled presentation or remove them, while keeping the footer layout visually balanced.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes you can improve it"
        ]
      },
      "acceptanceCriteria": [
        "Footer no longer contains anchor tags that navigate to \"#\" when clicked.",
        "Footer remains visually consistent with the existing warm theme and layout.",
        "No console errors or accessibility regressions are introduced by the footer change."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not edit files under frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything in frontend/src/components/ui (compose instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity only).",
    "Do not add real-time features (e.g., WebSockets).",
    "Do not introduce new backend storage schemas or migrations unless strictly required for the UX improvements above.",
    "Do not add new pages beyond Dashboard/Log/Insights/Settings."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}