{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "UX polish: guided first entry flow, dashboard limit meter, and footer link cleanup",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Route Log empty-state action to Dashboard and auto-open the Add Entry dialog once after navigation.",
      "acceptanceCriteria": [
        "When there are zero entries, clicking the empty-state button on /log routes the user to / (Dashboard).",
        "After navigation from the Log empty state, the Add Entry dialog opens automatically without additional clicks.",
        "The auto-open behavior triggers only once and does not keep re-opening on subsequent renders/navigation.",
        "No changes are made to immutable hook files (e.g., frontend/src/hooks/useInternetIdentity.ts[x], frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LogPage.tsx",
          "operation": "modify",
          "description": "Update the empty-state primary action to navigate to the Dashboard with a one-time URL signal (e.g., a query param) that requests opening the Add Entry dialog."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Consume the one-time URL signal on initial render via a guarded effect to automatically open EntryFormDialog once, then clear the signal so it does not re-trigger on subsequent renders/navigation."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add a small helper to read-and-clear a specific URL parameter (supporting hash/query scenarios already handled here) so the Dashboard can reliably consume the auto-open request exactly once."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an accessible daily-limit usage indicator (progress/meter) on the Dashboard with a distinct over-limit state.",
      "acceptanceCriteria": [
        "Dashboard shows a visual percent-used indicator for today’s caffeine intake relative to the daily limit.",
        "The indicator has a clear over-limit style (e.g., destructive color treatment) when todayTotal > dailyLimit.",
        "User-facing text remains in English and existing metrics (today total, daily limit, remaining) remain correct."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add a progress-style visual indicator (e.g., an HTML meter/progress with Tailwind styling) tied to the existing todayTotal/dailyLimit calculations; include accessible labeling (screen-reader text) and apply a visually distinct destructive treatment when over limit."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove or disable footer social icon links that currently point to '#', preserving layout and accessibility.",
      "acceptanceCriteria": [
        "Footer no longer contains anchor tags that navigate to \"#\" when clicked.",
        "Footer remains visually consistent with the existing warm theme and layout.",
        "No console errors or accessibility regressions are introduced by the footer change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/app/AppShell.tsx",
          "operation": "modify",
          "description": "Replace the placeholder footer social <a href=\"#\"> icons with a non-clickable presentation (e.g., <span> or disabled <button type=\"button\">) and ensure appropriate aria-label/aria-hidden usage while keeping spacing and visual balance consistent."
        }
      ]
    }
  ]
}